export interface TheaterData {
  branches: string[]
  screens: string[]
}

export const THEATERS: Record<string, TheaterData> = {
  CGV: {
    branches: [
      // 서울
      '강남', '강변', '건대입구', '고덕강일', '구로', '대학로', '동대문', '등촌', '명동', '미아', '방학', '불광', '상봉', '성신여대입구', '수유', '신촌아트레온', '압구정', '씨네드쉐프 압구정', '연남', '영등포타임스퀘어', '왕십리', '용산아이파크몰', '씨네드쉐프 용산', '중계', '천호', '피카디리1958', '홍대',
      // 경기
      '경기광주', '고양백석', '고양행신', '광교', '광교상현', '구리', '구리갈매', '김포', '김포운양', '김포한강', '남양주화도', '다산', '동수원', '동탄', '동탄역', '동탄호수공원', '배곧', '범계', '부천', '부천역', '산본', '서현', '소풍', '스타필드시티위례', '신세계경기', '안산', '야탑', '양주옥정', '역곡', '오리', '오산중앙', '의정부', '이천', '일산', '파주문산', '파주문정', '판교', '평촌', '평택', '평택고덕', '평택소사',
      // 인천
      '계양', '송도타임스페이스', '인천', '인천가정', '인천도화', '인천시민공원', '인천연수', '인천학익', '주안역', '청라',
      // 강원
      '강릉', '춘천',
      // 대전/충청
      '대전', '대전가수원', '대전가오', '대전탄방', '대전터미널', '서산', '세종', '유성노은', '천안터미널', '천안펜타포트', '청주(서문)', '청주지웰시티', '청주터미널', '홍성',
      // 대구
      '대구', '대구수성', '대구스타디움', '대구연경', '대구월성', '대구죽전', '대구한일', '대구현대',
      // 부산/울산
      '대연', '동래', '부산명지', '서면', '서면삼정타워', '서면상상마당', '센텀시티', '아시아드', '울산동구', '울산삼산', '울산신천', '울산진장', '정관', '하단아트몰링', '해운대',
      // 경상
      '거제', '김천율곡', '김해', '김해율하', '마산', '북포항', '안동', '양산삼호', '진주혁신', '창원더시티', '창원상남',
      // 광주/전라/제주
      '광양', '광주금남로', '광주상무', '광주용봉', '광주첨단', '광주하남', '나주', '목포평화광장', '서전주', '순천신대', '여수웅천', '전주고사', '전주효자', '제주', '제주노형'
    ],
    screens: [
      'IMAX', 'IMAX 레이저', '4DX', '4DX스크린', 'ScreenX', '템퍼시네마', 'GOLD CLASS',
      '1관', '2관', '3관', '4관', '5관', '6관', '7관', '8관', '9관', '10관', '11관', '12관', '13관'
    ],
  },
  메가박스: {
    branches: [
      '강남', '고양스타필드', '구리', '남양주별내', '독산', '동대문', '부산해운대',
      '성수', '수원AK플라자', '센텀시티', '송도', '신촌', '안성스타필드', '양주옥정',
      '영등포', '이수', '의정부', '인천논현', '코엑스', '하남스타필드',
    ],
    screens: [
      'MX', '돌비시네마', 'Boutique M', 'MX4D',
      '1관', '2관', '3관', '4관', '5관', '6관', '7관', '8관', '9관', '10관', '11관', '12관', '13관'
    ],
  },
  롯데시네마: {
    branches: [
      '건대입구', '광복', '금천', '김포공항', '노원', '대전', '롯데월드타워',
      '부산', '부평역사', '서울역', '수원', '신림', '영등포', '은평', '의정부', '인천터미널', '홍대',
    ],
    screens: [
      'SUPER4D', 'SUPER S', 'Super Plex G',
      '1관', '2관', '3관', '4관', '5관', '6관', '7관', '8관', '9관', '10관', '11관', '12관', '13관'
    ],
  },
}

export const BRAND_LIST = Object.keys(THEATERS)
